; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph3 - mode
	spectrograph2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star4 - direction
	Star1 - direction
	GroundStation6 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet17)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star4)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(pointing satellite0 Phenomenon12)
	(pointing satellite1 GroundStation2)
	(have_image Planet8 thermograph3)
	(have_image Phenomenon9 spectrograph0)
	(have_image Planet10 spectrograph2)
	(have_image Planet11 spectrograph2)
	(have_image Phenomenon12 thermograph3)
	(have_image Planet13 thermograph1)
	(have_image Planet14 thermograph3)
	(have_image Phenomenon15 spectrograph0)
	(have_image Star16 spectrograph2)
	(have_image Planet17 thermograph1)
))

)

; plan
1. (turn_to satellite1 star4 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 star4)
   goals met: 0 of 12
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 planet13 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet13)
   goals met: 0 of 12
5. (take_image satellite1 planet13 instrument2 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon9 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 12
7. (take_image satellite1 phenomenon9 instrument2 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 2 of 12
8. (turn_to satellite1 phenomenon15 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon15)
   goals met: 2 of 12
9. (turn_to satellite0 groundstation5 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 12
10. (take_image satellite1 phenomenon15 instrument2 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 3 of 12
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 12
12. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 3 of 12
13. (turn_to satellite0 planet10 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet10)
   goals met: 3 of 12
14. (take_image satellite0 planet10 instrument1 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 4 of 12
15. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 4 of 12
16. (take_image satellite0 planet11 instrument1 spectrograph2)
   added: (have_image planet11 spectrograph2)
   goals met: 5 of 12
17. (turn_to satellite0 planet14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet14)
   goals met: 5 of 12
18. (take_image satellite0 planet14 instrument1 thermograph3)
   added: (have_image planet14 thermograph3)
   goals met: 6 of 12
19. (turn_to satellite0 planet17 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet17)
   goals met: 6 of 12
20. (take_image satellite0 planet17 instrument1 thermograph1)
   added: (have_image planet17 thermograph1)
   goals met: 7 of 12
21. (turn_to satellite0 planet8 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet8)
   goals met: 7 of 12
22. (take_image satellite0 planet8 instrument1 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 8 of 12
23. (turn_to satellite0 star16 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star16)
   goals met: 8 of 12
24. (take_image satellite0 star16 instrument1 spectrograph2)
   added: (have_image star16 spectrograph2)
   goals met: 9 of 12
25. (turn_to satellite0 phenomenon12 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 phenomenon12)
   goals met: 10 of 12
26. (take_image satellite0 phenomenon12 instrument1 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 11 of 12
27. (turn_to satellite1 groundstation2 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 groundstation2)
   goals met: 12 of 12
